#include <iomanip>
#include <iostream>

template <typename T>
[[nodiscard]] constexpr T Sqr(T x) {
  return x * x;
}

template <typename T>
[[nodiscard]] constexpr T Formula(T a, T b) {
  const T diff = a - b;              // a - b
  const T diffSqr = Sqr(diff);       // (a - b)^2
  const T aSqr = Sqr(a);             // a^2
  const T twoAB = 2 * a * b;         // 2ab
  const T rightPart = aSqr - twoAB;  // a^2 - 2ab
  const T numerator = diffSqr - rightPart;
  const T denominator = Sqr(b);  // b^2
  return numerator / denominator;
}

int main() {
  constexpr float fA = 1000.0f;
  constexpr float fB = 0.0001f;

  constexpr double dA = 1000.0;
  constexpr double dB = 0.0001;

  std::cout << std::setprecision(10);
  std::cout << "float:  " << Formula(fA, fB) << "\n";
  std::cout << "double: " << Formula(dA, dB) << "\n";
}

/*
1. Тип float имеет ограниченную точность — примерно 7 значащих
   десятичных цифр. Тип double обеспечивает - 15 цифр.

2. В вычислениях используются числа сильно различающихся масштабов:
   a = 1000, b = 0.0001.
   При этом a² = 1 000 000, а b² = 0.00000001.

3. Основная проблема возникает при вычитании близких чисел:
   (a - b)² - (a² - 2ab).
   Математически результат этого выражения равен b².
   Однако из-за ограниченной точности float промежуточные результаты
   округляются, и небольшая величина b² теряется на фоне больших
   чисел порядка 1 000 000. (запятая сдвигается на 20 бит (log2(10^6) = ~20) и под мантиссу остается всего 4 бита)

4. Дополнительно выражение вычисляется по частям, и каждое промежуточное
   округление может накапливать ошибку. В итоге числитель может оказаться
   равным нулю или другому неточному значению вместо ожидаемого b².

5. Затем числитель делится на b². Поскольку b² = 0.00000001 очень мало,
   даже небольшая абсолютная ошибка числителя приводит к огромной
   относительной ошибке итогового результата.

6. Для double проблема значительно меньше благодаря более высокой
   точности представления чисел, поэтому результат обычно оказывается
   ближе к правильному значению — 1.

*/